Revit 2024 API
BuiltInFailures.CurveFailures.InvalidCurveForElement Property
 End positions are invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidCurveForElement { get; }
Visual Basic
Public Shared ReadOnly Property InvalidCurveForElement As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidCurveForElement {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CurveFailures Class
Autodesk.Revit.DB Namespace